const jobs = [
  {
    id: 1,
    company: "ASTON",
    position: "Frontend Developer",
    tasks: [
      "Разработка банковского веб-приложения на React",
      "Централизованное управление состоянием через Redux",
      "Работа с асинхронными запросами и их обработка (axios)",
      "Настройка маршрутизации и ленивой загрузки компонентов (router, lazy)",
      "Реализация валидации форм и взаимодействие с сервером (Formik)",
      "Оптимизация производительности и улучшение UX (useCallback, useMemo, SEO)",
      "Тестирование функционала и обеспечение безопасности приложения (Playwright, Firebase)",
    ],
  },
  {
    id: 2,
    company: "SkillsRock",
    position: "Frontend Developer (Intern)",
    tasks: [
      "Создание сайтовdddd на React по дизайну заказчика",
      "Использование Redux и нативного SCSS",
      "Изучение паттернов программирования и бизнес-логики",
      "Разработка и поддержка кастомных UI-компонентов под требования клиента",
    ],
  },
  {
    id: 3,
    company: "Purrweb",
    position: "Frontend Developer",
    tasks: [
      "Разработка кроссбраузерных веб-приложений на React / Next.js / TypeScript",
      "Использование UI-библиотек (DaisyUI, Chakra UI) и кастомных решений",
      "Рефакторинг и поддержка легаси-кода",
      "Покрытие e2e-тестами с использованием Playwright",
      "Работа с MySQL и Firebase",
    ],
  },
  {
    id: 4,
    company: "Sberbank",
    position: "Fullstack Developer",
    tasks: [
      "Разработка и поддержка внутренних банковских сервисов",
      "Создание клиентской части на React и TypeScript",
      "Разработка серверной логики на Express/Nest",
      "Интеграция фронтенда с backend API",
      "Работа с базами данных(sql and no sql) и серверной бизнес-логикой",
      "Участие в проектировании и развитии ai функционала в приложениях",
    ],
  },
];

export default jobs;
